"""
def aa(**kwargs):
    print(kwargs)
"""


def aa(**kwargs):
    print(kwargs)


aa(a=1, b='hello', c='tom')  # 装包{'a': 1, 'b': 'hello', 'c': 'tom'}

# 如果在开发的时候已知一个字典
dict1 = {'a': 1, 'b': 'hello', 'c': 'tom'}

aa(**dict1)  # a=1, b='hello', c='tom'  拆包的过程


# 今后开发时可能会遇到这种情况


def bb(a, b, *c, **d):
    # a, b都是必不可少项，少了就会报错
    # c和d都是可变参数，说明可有可无，可以传，也可以不传
    print(a, b, c, d)


# 调用
bb(1, 2)  # 1 2 () {}
bb(1, 2, 3, 4)  # 1 2 (3, 4) {}
bb(1, 2, x=100, y=200)  # 1 2 () {'x': 100, 'y': 200}
bb(1, 2, 3, x=100)  # 1 2 (3,) {'x': 100}
# bb(1, 2, x=100, 5, 6) # 报错，按照顺序赋值，有关键字的后面必须都是关键字
# 不允许关键字后面，又给元组或者必填项赋值

# 本节提到的：默认值参数、可变参数（*对应的是单独的元素，**对应的是关键字）、关键字参数
